README.md
```mermaid
sequenceDiagram
    participant P as PLC Device
    participant G as Gateway
    P ->> G: SSDP Discover: M-SEARCH
    G ->> P: SSDP Response
    P ->> G: HTTP GET [LOCATION from SSDP]
    G ->> P: HTTP Response with UPnP Description XML
    P ->> G: SOAP Action: GetSupportedDataModels
    G ->> P: SOAP Action Response
    P ->> G: SOAP Action: GetSupportedParameters
    G ->> P: SOAP Action Response
    P ->> G: SOAP Action: GetValues
    G ->> P: SOAP Action Response
```
